v2206/Projects/MRF_stirred_tank/0.orig/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7  
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    
    top
    {
        type               symmetry;
    }
    vessel
    {
        type               fixedValue;
        value              uniform (0 0 0);
    }

    impeller
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }


   
    
}

// ************************************************************************* //
